trade_exp/src/DataProcessors/УправлениеИзлишкиНедостачи_Альтерра/УправлениеИзлишкиНедостачи_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеИзлишкиНедостачи_Альтерра</name>
</mdclass:DataProcessor>

trade_exp/src/AccumulationRegisters/ТоварыКОформлениюИзлишковНедостач/ТоварыКОформлениюИзлишковНедостач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="31f929cb-7f61-4c5e-9806-c9ea6e81e790">
  <name>ТоварыКОформлениюИзлишковНедостач</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="70a0786f-ecb4-490c-9859-a9080d6d314b">
    <name>КОформлениюАктов</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="e5c15b48-6100-48e0-9566-fac00a7bf807">
    <name>Сторно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="95310fd4-33c3-4a9b-93a5-949bd3f3d035">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="a0a36430-a512-4369-af11-fbe78b5dad54">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="18d00fec-242d-4860-9e90-0e0fe20956fe">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="6554474d-b5f8-457c-aa41-d997e29391b4">
    <name>Назначение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0ddea113-0255-44dc-b29d-bf7c3ec10b59">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СекцииКладовщиков/СекцииКладовщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="781a52b6-91f0-4269-a9f6-6318173ceec5">
  <name>СекцииКладовщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="a7af1fbb-3166-45f9-95cd-e947aaf54ece">
    <name>Кладовщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ada791ba-7f50-4d94-960e-e5c5fbd64385">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="93089e66-0030-429b-b7ec-8d8eca2e1bb0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="26ee698b-2e6a-4d4b-9aa5-846e60bfab67">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ОприходованиеИзлишковТоваров/ОприходованиеИзлишковТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОприходованиеИзлишковТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7a6aa00-7209-4006-94f6-c9dff24f6c36">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b702872a-ff55-42de-874e-18cc7a282867">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2eb46e7c-716d-4be4-aa38-2fc009550c44">
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ca95b564-2edc-42ea-b560-434d30f026a6">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c60c8224-938d-4349-ba8a-1a8e21ddde83">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/СписаниеНедостачТоваров/СписаниеНедостачТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СписаниеНедостачТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидДеятельностиНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаАктивовПассивов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2a759476-634c-49ca-98f6-188e8168647e">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b233622f-e90f-48dd-9caf-289bb72dd238">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Кладовщик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="80f88656-3c34-46f6-be0d-e204c50e6846">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Documents/ОрдерНаОтражениеИзлишковТоваров/ОрдерНаОтражениеИзлишковТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3aa37dd0-9f3a-43a2-8cb9-e23caed2a1f8">
  <name>ОрдерНаОтражениеИзлишковТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="86d43ea6-a1c0-43cc-8d76-e9666ec5d673">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a20f3d58-3b78-461a-aa6c-1408ff4bad57">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="db457f3d-83ff-4a5a-8117-ef5aac4b933e">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d97a63b8-7843-495d-a891-7491a1dee3d0">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="395bf2da-37a2-4d97-a339-034e29d39c34">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="984ac93e-7c79-459b-97af-c90af57d4421">
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="18711a34-336d-4cc9-9ffe-660485fd392f">
    <name>ПодтвержденСкладом</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="2f582bb4-f069-4136-b29e-8f8909c649bd">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c915cdda-46e9-468f-866c-9cf58b756b4c">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d85008e6-9f8b-42fc-93cd-19c6b5f38fa9">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6178af8b-3770-4726-a5e9-988319e0f8d9">
      <name>Ячейка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="52f20c4a-290a-4422-8974-a76fc07ff2f8">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f4a3dd71-ade8-423d-8cae-9604b23cc60f">
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c2a21d0d-f57d-43f3-8075-6550275c7e38">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="78b246cf-3487-475b-90bc-f2dbc3fe83fb">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/УправлениеИзлишкиНедостачи_Альтерра/Forms/ФормаИзлишкиНедостачи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСкладПоУмолчанию();
	
	ФильтрОрдеров = "НеПодтвержденные";
	Элементы.УтвердитьОрдер1.Доступность = РольДоступнаПодтверждениеСкладом();		
	СкладПомещениеПриИзмененииСервер();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	СписокТипов = ОрдераВРаботе.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = СписокТипов;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ОрдераВРаботеГруппаКоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп = "ОрдераВРаботе";
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");

	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
		
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряженияНаПоступление

&НаКлиенте
Процедура РаспоряженияНаПоступлениеПриАктивизацииСтроки(Элемент)
	
	ТекущаяСтрока = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
	
	Если ТекущаяСтрока<>Неопределено Тогда
		
		СсылкаНаДокумент = ТекущаяСтрока.Распоряжение;
		ТекущийРабочийУчасток =ТекущаяСтрока.РабочийУчасток; 
		
		Если ОтображатьТовары Тогда
			ЗаполнитьТовары(Ложь,СсылкаНаДокумент);
		КонецЕсли;
		
		Если ОтображатьОрдераПоТекущемуРаспоряжению Тогда
			 ЗаполнитьОрдераПоТекРаспоряжению(СсылкаНаДокумент);
		КонецЕсли;
		
		Элементы.РаспоряженияНаПоступлениеСоздатьОрдер.Видимость = ТекущаяСтрока.ОрдерНеСоздан;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция РаспоряжениеНаПоступление()
	
	Если Элементы.РаспоряженияНаПоступление.ТекущиеДанные <> Неопределено Тогда
		Возврат Элементы.РаспоряженияНаПоступление.ТекущиеДанные.Распоряжение;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Документ.ОприходованиеИзлишковТоваров.ПустаяСсылка");
	
КонецФункции

&НаСервере
Процедура УстановитьОтборыВЗависимыхСписках()
	
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Склад", Склад, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка.РабочийУчасток", РабочиеУчастки, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		
	Если ФильтрОрдеров = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка.ПодтвержденСкладом", Истина, ВидСравненияКомпоновкиДанных.Равно,,Ложь);
	ИначеЕсли ФильтрОрдеров = "Подтвержденные" Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка.ПодтвержденСкладом", Истина, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли ФильтрОрдеров = "НеПодтвержденные" Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка.ПодтвержденСкладом", Ложь, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриходныеОрдераПоРаспоряжению(Распоряжение)

	Запрос = Новый Запрос;
	Запрос.Текст = 		
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СкладскиеОрдераНаИзлишкиНедостачиПорчи.Ссылка КАК Ссылка
	|ИЗ
	|	ЖурналДокументов.СкладскиеОрдераНаИзлишкиНедостачиПорчи КАК СкладскиеОрдераНаИзлишкиНедостачиПорчи
	|ГДЕ
	|	СкладскиеОрдераНаИзлишкиНедостачиПорчи.Ссылка.Основание = &Распоряжения";
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);	
	ПриходныеОрдера = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат ПриходныеОрдера;
	
КонецФункции

Процедура ЗаполнитьСкладПоУмолчанию()
	
	СтруктураЗаполнения = Новый Структура("Склад");
	ОбщегоНазначенияУТ.ОбработкаЗаполнения(СтруктураЗаполнения, Неопределено, Неопределено);
	Склад = СтруктураЗаполнения.Склад;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкладПомещениеПриИзмененииСервер()
	
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	Если ЗначениеЗаполнено(Склад) Тогда
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Склад);			
	Иначе
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Неопределено);
	КонецЕсли;
	
	РабочиеУчастки.Очистить();
		
	УстановитьОтборыВОсновныхСписках();
	
КонецПроцедуры

Процедура УстановитьОтборыВОсновныхСписках()
	//ЗаполнитьРаспоряженияНаПоступление();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспоряженияНаПоступление()
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		РаспоряженияНаПоступление.Очистить();
		Возврат;
	КонецЕсли;
	
	Если Не Пользователи.ЭтоПолноправныйПользователь(Неопределено) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка = &Склад";
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Если Запрос.Выполнить().Пустой() Тогда
			РаспоряженияНаПоступление.Очистить();
			Возврат;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ОприходованиеИзлишковТоваров)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.СписаниеНедостачТоваров)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ПересортицаТоваров)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ПорчаТоваров)
	|			ТОГДА ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор
	|		ИНАЧЕ ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор.Основание
	|	КОНЕЦ КАК Распоряжение,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Характеристика КАК Характеристика,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Склад КАК Склад,
	|	СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовПриход) КАК КОформлениюАктовПриход,
	|	СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовРасход) КАК КОформлениюАктовРасход,
	|	-1 * (СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовПриход) - СУММА(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.КОформлениюАктовРасход)) КАК КОформлениюОрдеров,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция
	|ПОМЕСТИТЬ ВременнаяТаблица
	|ИЗ
	|	РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.ОстаткиИОбороты(&ДатаНачала, &ДатаОкончания, Регистратор, , Склад = &Склад) КАК ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
	|		ПО ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Склад)
	|ГДЕ
	|	(ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ОприходованиеИзлишковТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.СписаниеНедостачТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ПересортицаТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ПорчаТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ОрдерНаОтражениеИзлишковТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ОрдерНаОтражениеНедостачТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ОрдерНаОтражениеПересортицыТоваров)
	|			ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ОрдерНаОтражениеПорчиТоваров))
	|	И ВЫБОР
	|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&РабочиеУчастки)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Номенклатура,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Характеристика,
	|	ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Склад,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ОприходованиеИзлишковТоваров)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.СписаниеНедостачТоваров)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ПересортицаТоваров)
	|				ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор) = ТИП(Документ.ПорчаТоваров)
	|			ТОГДА ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор
	|		ИНАЧЕ ТоварыКОформлениюИзлишковНедостачОстаткиИОбороты.Регистратор.Основание
	|	КОНЕЦ,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблица.Распоряжение.Дата КАК Дата,
	|	ВременнаяТаблица.Распоряжение.Номер КАК Номер,
	|	ТИПЗНАЧЕНИЯ(ВременнаяТаблица.Распоряжение) КАК ТипДокумента,
	|	ВременнаяТаблица.Распоряжение КАК Распоряжение,
	|	ВременнаяТаблица.Секция КАК РабочийУчасток,
	|	ВременнаяТаблица.Склад КАК Склад,
	|	ВЫБОР
	|		КОГДА СУММА(ВременнаяТаблица.КОформлениюОрдеров) > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ОрдерНеСоздан
	|ИЗ
	|	ВременнаяТаблица КАК ВременнаяТаблица
	|
	|СГРУППИРОВАТЬ ПО
	|	ВременнаяТаблица.Распоряжение,
	|	ВременнаяТаблица.Секция,
	|	ВременнаяТаблица.Склад,
	|	ВременнаяТаблица.Распоряжение.Дата,
	|	ВременнаяТаблица.Распоряжение.Номер,
	|	ТИПЗНАЧЕНИЯ(ВременнаяТаблица.Распоряжение)";
	
	
	Запрос.УстановитьПараметр("РабочиеУчастки", РабочиеУчастки.ВыгрузитьЗначения());
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Если ЗначениеЗаполнено(ДатаПоступления) Тогда
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаПоступления.ДатаОкончания)); 
		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаПоступления.ДатаНачала)); 
	Иначе
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата())); 
	    Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата())); 
	КонецЕсли;
			
	РаспоряженияНаПоступление.Загрузить(Запрос.Выполнить().Выгрузить());
		
КонецПроцедуры

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ОтборРазмещениеТоваров.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если МассивСсылок.Количество() > 0 Тогда
		Ссылка = МассивСсылок[0];
		Элементы.ЗаданияВРаботе.ТекущаяСтрока = Ссылка;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.СтраницаРазмещение;
		ПоказатьЗначение(Неопределено, Ссылка);
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ИзменениеСпискаОрдераВРаботе(РаспоряжениеНаПоступление) 
	ЗаполнитьРаспоряженияНаПоступление();
	УстановитьОтборыВЗависимыхСписках();
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.УправлениеПоступлением.Форма.Элемент.Склад.ПриИзменении");
	
	СкладПриИзмененииСервер(РаспоряжениеНаПоступление());		
	
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер(РаспоряжениеНаПоступление)
	СкладПомещениеПриИзмененииСервер();
	УстановитьОтборыВЗависимыхСписках();
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПоступленияФильтрПриИзменении(Элемент)
	
	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
	
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОрдеровПриИзменении(Элемент)
	УстановитьОтборыВЗависимыхСписках();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление)
	
	УстановитьОтборыВОсновныхСписках();
	УстановитьОтборыВЗависимыхСписках();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдер(Команда)
	
	ОчиститьСообщения();
	ТекущиеДанные = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда

		ЗаполнитьТовары(Ложь,ТекущиеДанные.Распоряжение);

		Основание = Новый Структура;
		Основание.Вставить("Основание",               ТекущиеДанные.Распоряжение);
		Основание.Вставить("Склад",               Склад);
		Основание.Вставить("РабочийУчасток",      ТекущиеДанные.РабочийУчасток);
		Основание.Вставить("Товары", Товары);
		
		Если ТекущиеДанные.ТипДокумента = "Оприходование излишков товаров" Тогда
			ОткрытьФорму("Документ.ОрдерНаОтражениеИзлишковТоваров.Форма.ФормаДокумента",
			Новый Структура("Основание",Основание));
		КонецЕсли;
		
		Если ТекущиеДанные.ТипДокумента = "Списание недостач товаров" Тогда
			ОткрытьФорму("Документ.ОрдерНаОтражениеНедостачТоваров.Форма.ФормаДокумента",
			Новый Структура("Основание",Основание));
		КонецЕсли;
		
		Если ТекущиеДанные.ТипДокумента = "Пересортица товаров" Тогда
			ОткрытьФорму("Документ.ОрдерНаОтражениеПересортицыТоваров.Форма.ФормаДокумента",
			Новый Структура("Основание",Основание));
		КонецЕсли;
		
		Если ТекущиеДанные.ТипДокумента = "Порча товаров" Тогда
			ОткрытьФорму("Документ.ОрдерНаОтражениеПорчиТоваров.Форма.ФормаДокумента",
			Новый Структура("Основание",Основание));
		КонецЕсли;
	Иначе
			
		ТекстПредупреждения = НСтр("ru = 'Выберите распоряжение на оформление ордера'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТовары()
	Возврат Товары.Выгрузить();
Конецфункции

&НаКлиенте
Процедура ОрдераВРаботеПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ТекущаяСтрока = Элементы.ОрдераВРаботе.ТекущиеДанные;
	Если ТекущаяСтрока<>Неопределено Тогда
	СсылкаНаДокумент = ТекущаяСтрока.Ссылка;
	ЗаполнитьТовары(Истина,СсылкаНаДокумент);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьТовары(ЭтоОрдер,СсылкаНаДокумент)
	Товары.Очистить();
	Если ЭтоОрдер Тогда
		Если СсылкаНаДокумент.Проведен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОприходованиеИзлишковТоваровТовары.Номенклатура КАК Номенклатура,
		|	ОприходованиеИзлишковТоваровТовары.Характеристика КАК Характеристика,
		|	ОприходованиеИзлишковТоваровТовары.Ссылка.Склад КАК Склад,
		|	ОприходованиеИзлишковТоваровТовары.Количество КАК КоличествоУпаковок,
		|	NULL КАК НоменклатураОприходование,
		|	NULL КАК ХарактеристикаОприходование
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.ОрдерНаОтражениеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
		|ГДЕ
		|	ОприходованиеИзлишковТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеНедостачТоваровТовары.Номенклатура,
		|	СписаниеНедостачТоваровТовары.Характеристика,
		|	СписаниеНедостачТоваровТовары.Ссылка.Склад,
		|	СписаниеНедостачТоваровТовары.Количество,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.ОрдерНаОтражениеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
		|ГДЕ
		|	СписаниеНедостачТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПересортицаТоваровТовары.Номенклатура,
		|	ПересортицаТоваровТовары.Характеристика,
		|	ПересортицаТоваровТовары.Ссылка.Склад,
		|	ПересортицаТоваровТовары.Количество,
		|	ПересортицаТоваровТовары.НоменклатураОприходование,
		|	ПересортицаТоваровТовары.ХарактеристикаОприходование
		|ИЗ
		|	Документ.ОрдерНаОтражениеПересортицыТоваров.Товары КАК ПересортицаТоваровТовары
		|ГДЕ
		|	ПересортицаТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПорчаТоваровТовары.Номенклатура,
		|	ПорчаТоваровТовары.Характеристика,
		|	ПорчаТоваровТовары.Ссылка.Склад,
		|	ПорчаТоваровТовары.Количество,
		|	ПорчаТоваровТовары.НоменклатураОприходование,
		|	ПорчаТоваровТовары.ХарактеристикаОприходование
		|ИЗ
		|	Документ.ОрдерНаОтражениеПорчиТоваров.Товары КАК ПорчаТоваровТовары
		|ГДЕ
		|	ПорчаТоваровТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Склад КАК Склад,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	ВТ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_Товары.НоменклатураОприходование КАК НоменклатураОприходование,
		|	ВТ_Товары.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование.Ячейка КАК ЯчейкаОприходование
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ВТ_Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование
		|		ПО ВТ_Товары.НоменклатураОприходование = РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование.Номенклатура
		|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование.Склад
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование.ОсновнаяЯчейка = ИСТИНА)";
		
		Запрос.УстановитьПараметр("Ссылка",СсылкаНаДокумент);
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОприходованиеИзлишковТоваровТовары.Номенклатура КАК Номенклатура,
		|	ОприходованиеИзлишковТоваровТовары.Характеристика КАК Характеристика,
		|	ОприходованиеИзлишковТоваровТовары.Ссылка.Склад КАК Склад,
		|	ОприходованиеИзлишковТоваровТовары.Количество КАК КоличествоУпаковок,
		|	NULL КАК НоменклатураОприходование,
		|	NULL КАК ХарактеристикаОприходование
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.ОприходованиеИзлишковТоваров.Товары КАК ОприходованиеИзлишковТоваровТовары
		|ГДЕ
		|	ОприходованиеИзлишковТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеНедостачТоваровТовары.Номенклатура,
		|	СписаниеНедостачТоваровТовары.Характеристика,
		|	СписаниеНедостачТоваровТовары.Ссылка.Склад,
		|	СписаниеНедостачТоваровТовары.Количество,
		|	NULL,
		|	NULL
		|ИЗ
		|	Документ.СписаниеНедостачТоваров.Товары КАК СписаниеНедостачТоваровТовары
		|ГДЕ
		|	СписаниеНедостачТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПересортицаТоваровТовары.Номенклатура,
		|	ПересортицаТоваровТовары.Характеристика,
		|	ПересортицаТоваровТовары.Ссылка.Склад,
		|	ПересортицаТоваровТовары.Количество,
		|	ПересортицаТоваровТовары.НоменклатураОприходование,
		|	ПересортицаТоваровТовары.ХарактеристикаОприходование
		|ИЗ
		|	Документ.ПересортицаТоваров.Товары КАК ПересортицаТоваровТовары
		|ГДЕ
		|	ПересортицаТоваровТовары.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПорчаТоваровТовары.Номенклатура,
		|	ПорчаТоваровТовары.Характеристика,
		|	ПорчаТоваровТовары.Ссылка.Склад,
		|	ПорчаТоваровТовары.Количество,
		|	ПорчаТоваровТовары.НоменклатураОприходование,
		|	ПорчаТоваровТовары.ХарактеристикаОприходование
		|ИЗ
		|	Документ.ПорчаТоваров.Товары КАК ПорчаТоваровТовары
		|ГДЕ
		|	ПорчаТоваровТовары.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	ВТ_Товары.Характеристика КАК Характеристика,
		|	ВТ_Товары.Склад КАК Склад,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка,
		|	ВТ_Товары.КоличествоУпаковок КАК КоличествоУпаковок,
		|	ВТ_Товары.НоменклатураОприходование КАК НоменклатураОприходование,
		|	ВТ_Товары.ХарактеристикаОприходование КАК ХарактеристикаОприходование,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование.Ячейка КАК ЯчейкаОприходование
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ВТ_Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование
		|		ПО ВТ_Товары.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование.Номенклатура
		|			И ВТ_Товары.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование.Склад
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкамОприходование.ОсновнаяЯчейка = ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
		|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";
		
		Запрос.УстановитьПараметр("Ссылка",СсылкаНаДокумент);
		Запрос.УстановитьПараметр("РабочиеУчастки",ТекущийРабочийУчасток);
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
	Элементы.ТоварыГруппаОприходвание.Видимость = ?(ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПересортицаТоваров") ИЛИ
		ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ПорчаТоваров") ИЛИ 
		ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОрдерНаОтражениеПересортицыТоваров")  
		ИЛИ ТипЗнч(СсылкаНаДокумент) = Тип("ДокументСсылка.ОрдерНаОтражениеПорчиТоваров"),Истина,Ложь);
		
	КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТоварыПриИзменении(Элемент)
	Элементы.Группа4.Видимость = ОтображатьТовары;
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Список = Элементы.ОрдераВРаботе;

	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	Список = Элементы.ОрдераВРаботе;
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	Список = Элементы.ОрдераВРаботе;

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.Группа1.ТекущаяСтраница.Имя = "Группа2" Тогда
		ТекущаяСтрока = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
		Если ТекущаяСтрока<>Неопределено Тогда
			СсылкаНаДокумент = ТекущаяСтрока.Распоряжение;
			ЗаполнитьТовары(Ложь,СсылкаНаДокумент);
		КонецЕсли;	
	Иначе
		ТекущаяСтрока = Элементы.ОрдераВРаботе.ТекущиеДанные;
		Если ТекущаяСтрока<>Неопределено Тогда
			СсылкаНаДокумент = ТекущаяСтрока.Ссылка;
			ЗаполнитьТовары(Истина,СсылкаНаДокумент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьОрдераПоТекущемуРаспоряжениюПриИзменении(Элемент)
	Элементы.Группа6.Видимость=ОтображатьОрдераПоТекущемуРаспоряжению;
КонецПроцедуры

Процедура ЗаполнитьОрдераПоТекРаспоряжению(РаспоряжениеНаПоступление)
ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераПоТекущемуРаспоряжению, "Ссылка.Основание", РаспоряжениеНаПоступление, ВидСравненияКомпоновкиДанных.Равно,,Истина);									
КонецПроцедуры

&НаСервере
Процедура УтвердитьОрдерНаСервере(СсылкаНаДокумент)
	 Ордер = СсылкаНаДокумент.ПолучитьОбъект();
     Ордер.ПодтвержденСкладом = Истина;
	 Ордер.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура УтвердитьОрдер(Команда)
	
	ТекущаяСтраница = Неопределено;
	
	Если Элементы.Группа1.ТекущаяСтраница.Имя = "Группа2" Тогда
		 ТекущаяСтрока = Элементы.ОрдераПоТекущемуРаспоряжению.ТекущиеДанные;
	 ИначеЕсли Элементы.Группа1.ТекущаяСтраница.Имя = "Группа3" Тогда
		 ТекущаяСтрока = Элементы.ОрдераВРаботе.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущаяСтрока<>Неопределено Тогда
	СсылкаНаДокумент = ТекущаяСтрока.Ссылка;
	УтвердитьОрдерНаСервере(СсылкаНаДокумент);
    КонецЕсли;

	ТекущаяСтрокаР = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
	
	Если ТекущаяСтрокаР<>Неопределено Тогда
		
		СсылкаНаДокумент = ТекущаяСтрокаР.Распоряжение;
		ЗаполнитьОрдераПоТекРаспоряжению(СсылкаНаДокумент);
			
	КонецЕсли;

	Элементы.ОрдераВРаботе.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура РабочиеУчасткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	
	РабочиеУчастки.Очистить();
	ПараметрыОтбора =  Новый Структура;
	ЗначениеОтбора =  Новый Структура;
	ЗначениеОтбора.Вставить("Владелец", Склад);
	ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
	ПараметрыОтбора.Вставить("Отбор", ЗначениеОтбора);
	ПараметрыОтбора.Вставить("МножественныйВыбор", Истина);
	Форма = ОткрытьФорму("Справочник.РабочиеУчастки.ФормаВыбора",ПараметрыОтбора , Элемент);

	Если ЕстьРабочиеУчасткиПользователя() Тогда
		
		ОтборВладелец =Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ОтборВладелец.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
		ОтборВладелец.Использование = Истина; 
		ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка"); 
		ОтборВладелец.ПравоеЗначение = ПолучитьРабочиеУчасткиПользователя();    
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ЕстьРабочиеУчасткиПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СекцииКладовщиков.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.СекцииКладовщиков КАК СекцииКладовщиков
		|ГДЕ
		|	СекцииКладовщиков.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

&НаСервере
Функция ПолучитьРабочиеУчасткиПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СекцииКладовщиков.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.СекцииКладовщиков КАК СекцииКладовщиков
		|ГДЕ
		|	СекцииКладовщиков.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатЗапросаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивЗначений = Новый Массив();
	
	Пока РезультатЗапросаДетальныеЗаписи.Следующий() Цикл
		МассивЗначений.Добавить(РезультатЗапросаДетальныеЗаписи.Ячейка);
	КонецЦикла;
	
	Возврат МассивЗначений;
КонецФункции

&НаКлиенте
Процедура РабочиеУчасткиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого Элем из ВыбранноеЗначение цикл
	 РабочиеУчастки.Добавить(Элем);
     Конеццикла;
    РабочиеУчастки.Добавить(ПустойУчасток());
	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
КонецПроцедуры

Функция ПустойУчасток()
	Возврат Справочники.РабочиеУчастки.ПустаяСсылка();
КонецФункции

Функция РольДоступнаПодтверждениеСкладом()
	Возврат АльтерраОбщегоНазначения._РольДоступна("ПодтверждениеСкладом") ИЛИ АльтерраОбщегоНазначения._РольДоступна("ПолныеПрава");
КонецФункции
